while True:
    #Виведення інтерфейсу програми
    print( """---------------------------------------------------------------------------------------------------------
    Тема модуля 1:       Програмування лінійних алгоритмів та розгалужених процесів
                            Виконала студентка гр. КМ-61 Сом Анна Олексіївна
                                            Варіант №20
                                          Умова завдання:
    1. Користувач вводить три числа. Знайдіть середнє арифметичне цих чисел,
    а також різницю подвоєної суми першого і третього чисел і потроєного другого числа.             
    2. Знайти max {min (a, b), min (c, d)}. Числа вводити з клавіатури.
---------------------------------------------------------------------------------------------------------
    """)
    
    nomer = input("Введіть номер завдання, або 0 для виходу з програми: ")

    # Завдання №1
    if nomer == "1":
        a = float(input("Введіть число a: "))
        b = float(input("Введіть число b: "))
        c = float(input("Введіть число c: "))

        # Знаходження сер. арифм. за формулою (A1 + A2 + ... + An) / n
        average = (a + b + c) / 3

        # Знаходження різниці
        diff = 2 * (a + c) - 3 * b

        print("Середнє арифметичне чисел", a, b, c, "становить", average,
            "\nРізниця подвоєної суми", a, c, "та потроєного", b, "становить", diff, "\n")

        input("Натисніть Enter, щоб повернутися на початок")
        continue

    # Завдання №2
    elif nomer == "2":
        a = float(input("Введіть число a: "))
        b = float(input("Введіть число b: "))
        c = float(input("Введіть число c: "))
        d = float(input("Введіть число d: "))

        # Знаходження мінімуму з першої пари (a,b)
        if a < b:
            min1 = a
        else:
            min1 = b

        # Знаходження мінімуму з другої пари (c,d)
        if c < d:
            min2 = c
        else:
            min2 = d

        # Знаходження максимуму з попередніх мінімумів
        if min1 < min2:
            max1 = min2
        else:
            max1 = min1

        print("Максимум серед мінімумів становить", max1, "\n")

        input("Натисніть Enter, щоб повернутися на початок")
        continue

    # При введенні 0 цикл переривається
    elif nomer == "0":
        print("Виконався вихід із програми")
        break

    # При введенні іншої цифри/символа програма перезапуститься
    else:
        print("Некоректний номер завдання, повернення на початок\n")